public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Mythical Man-Month Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="The Mythical Man-Month Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-10T22:35+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">The Mythical Man-Month Notes</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">The Tar Pit</a>
<ul>
<li><a href="#sec-1-1">The Programming Systems Product</a></li>
<li><a href="#sec-1-2">The Joys of the Craft</a></li>
<li><a href="#sec-1-3">The Woes of the Craft</a></li>
</ul>
</li>
<li><a href="#sec-2">The Mythical Man-Month</a></li>
<li><a href="#sec-3">The Surgical Team</a>
<ul>
<li><a href="#sec-3-1">Mills's Proposal</a></li>
<li><a href="#sec-3-2">How It Works</a></li>
</ul>
</li>
<li><a href="#sec-4">Aristocracy, Democracy, and System Design</a>
<ul>
<li><a href="#sec-4-1">Conceptual Integrity</a></li>
<li><a href="#sec-4-2">Achieving Conceptual Integrity</a></li>
<li><a href="#sec-4-3">Aristocracy and Democracy</a></li>
<li><a href="#sec-4-4">What Does the Implementer Do While Waiting?</a></li>
</ul>
</li>
<li><a href="#sec-5">The Second-System Effect</a>
<ul>
<li><a href="#sec-5-1">Interactive Discipline for the Architect</a></li>
<li><a href="#sec-5-2">Self-Discipline—The Second-System Effect</a></li>
</ul>
</li>
<li><a href="#sec-6">Passing the Word</a>
<ul>
<li><a href="#sec-6-1">Written Specifications—the Manual</a></li>
<li><a href="#sec-6-2">Formal Definitions</a></li>
<li><a href="#sec-6-3">Direct Incorporation</a></li>
<li><a href="#sec-6-4">Conferences and Courts</a></li>
<li><a href="#sec-6-5">The Telephone Log</a></li>
<li><a href="#sec-6-6">Product Test</a></li>
</ul>
</li>
<li><a href="#sec-7">Why Did the Tower of Babel Fail?</a>
<ul>
<li><a href="#sec-7-1">A Management Audit of the Babel Project</a></li>
<li><a href="#sec-7-2">Communication in the Large Programming Project</a></li>
<li><a href="#sec-7-3">The Project Workbook</a></li>
<li><a href="#sec-7-4">Organization in the Large Programming Project</a></li>
</ul>
</li>
<li><a href="#sec-8">Calling the Shot</a></li>
<li><a href="#sec-9">Ten Pounds in a Five-Pound Sack</a>
<ul>
<li><a href="#sec-9-1">Program Space as Cost</a></li>
<li><a href="#sec-9-2">Size Control</a></li>
<li><a href="#sec-9-3">Space Techniques</a></li>
<li><a href="#sec-9-4">Representation Is the Essence of Programming</a></li>
</ul>
</li>
<li><a href="#sec-10">The Documentary Hypothesis</a>
<ul>
<li><a href="#sec-10-1">Documents for a Computer Product</a></li>
<li><a href="#sec-10-2">Documents for a University Department</a></li>
<li><a href="#sec-10-3">Documents for a Software Project</a></li>
<li><a href="#sec-10-4">Why Have Formal Documents?</a></li>
</ul>
</li>
<li><a href="#sec-11">Plan to Throw One Away</a>
<ul>
<li><a href="#sec-11-1">Pilot Plants and Scaling Up</a></li>
<li><a href="#sec-11-2">The Only Constancy Is Change Itself</a></li>
<li><a href="#sec-11-3">Plan the System for Change</a></li>
<li><a href="#sec-11-4">Plan the Organization for Change</a></li>
<li><a href="#sec-11-5">One Step Forward and One Step Back</a></li>
</ul>
</li>
<li><a href="#sec-12">Sharp Tools</a>
<ul>
<li><a href="#sec-12-1">Target Machines</a></li>
<li><a href="#sec-12-2">Scheduling.</a></li>
<li><a href="#sec-12-3">Vehicle Machines and Data Services</a></li>
<li><a href="#sec-12-4">Compiler and assembler vehicles.</a></li>
<li><a href="#sec-12-5">Program libraries and accounting.</a></li>
<li><a href="#sec-12-6">Program tools.</a></li>
<li><a href="#sec-12-7">Documentation system.</a></li>
<li><a href="#sec-12-8">Performance simulator.</a></li>
<li><a href="#sec-12-9">High-Level Language and Interactive Programming</a></li>
</ul>
</li>
<li><a href="#sec-13">The Whole and the Parts</a>
<ul>
<li><a href="#sec-13-1">Designing the Bugs Out</a></li>
<li><a href="#sec-13-2">Component Debugging</a></li>
<li><a href="#sec-13-3">System Debugging</a></li>
</ul>
</li>
<li><a href="#sec-14">Hatching a Catastrophe</a>
<ul>
<li><a href="#sec-14-1">Milestones or Millstones?</a></li>
<li><a href="#sec-14-2">"The Other Piece Is Late, Anyway"</a></li>
<li><a href="#sec-14-3">Under the Rug</a></li>
</ul>
</li>
<li><a href="#sec-15">The Other Face</a>
<ul>
<li><a href="#sec-15-1">What Documentation Is Required?</a></li>
<li><a href="#sec-15-2">The Flow-Chart Curse</a></li>
<li><a href="#sec-15-3">Self-Documenting Programs</a></li>
</ul>
</li>
<li><a href="#sec-16">No Silver Bullet-Essence and Accident in Software Engineering</a>
<ul>
<li><a href="#sec-16-1">Abstract[16]</a></li>
<li><a href="#sec-16-2">Introduction</a></li>
<li><a href="#sec-16-3">Does It Have to Be Hard?—Essential Difficulties</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The Tar Pit</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">The Programming Systems Product</h3>
<div class="outline-text-3" id="text-1-1">

<p>Moving down across the horizontal boundary, a program
becomes a programming product. This is a program that can be run,tested, repaired, and extended by anybody. It is usable in many
operating environments, for many sets of data. To become a generally
usable programming product, a program must be written in a
generalized fashion. In particular the range and form of inputs
must be generalized as much as the basic algorithm will reasonably
allow. Then the program must be thoroughly tested, so that it can
be depended upon. This means that a substantial bank of test
cases, exploring the input range and probing its boundaries, must
be prepared, run, and recorded. Finally, promotion of a program
to a programming product requires its thorough documentation, so
that anyone may use it, fix it, and extend it. As a rule of thumb,
I estimate that a programming product costs at least three times as
much as a debugged program with the same function.
</p>
<p>
Moving across the vertical boundary, a program becomes a
component in a programming system. This is a collection of interacting
programs, coordinated in function and disciplined in format,
so that the assemblage constitutes an entire facility for large tasks.
To become a programming system component, a program must be
written so that every input and output conforms in syntax and
semantics with precisely defined interfaces. The program must
also be designed so that it uses only a prescribed budget of resources—
memory space, input-output devices, computer time. Finally,
the program must be tested with other system components,
in all expected combinations. This testing must be extensive, for
the number of cases grows combinatorially. It is time-consuming,
for subtle bugs arise from unexpected interactions of debugged
components. A programming system component costs at least
three times as much as a stand-alone program of the same function.
The cost may be greater if the system has many components.
</p>
<p>
In the lower right-hand corner of Fig. 1.1 stands the programming
systems product. This differs from the simple program in all of
the above ways. It costs nine times as much. But it is the truly
useful object, the intended product of most system programming
efforts.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">The Joys of the Craft</h3>
<div class="outline-text-3" id="text-1-2">

<p>First is the sheer joy of making things
</p>
<p>
Second is the pleasure of making things that are useful to
other people.
</p>
<p>
Third is the fascination of fashioning complex puzzle-like
objects of interlocking moving parts and watching them work in
subtle cycles, playing out the consequences of principles built in
from the beginning.
</p>
<p>
Fourth is the joy of always learning, which springs from the
nonrepeating nature of the task.
</p>
<p>
Finally, there is the delight of working in such a tractable
medium.
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">The Woes of the Craft</h3>
<div class="outline-text-3" id="text-1-3">

<p>First, one must perform perfectly. The computer resembles the
magic of legend in this respect, too. If one character, one pause, of
the incantation is not strictly in proper form, the magic doesn't
work.
</p>
<p>
Next, other people set one's objectives, provide one's resources,
and furnish one's information. One rarely controls the
circumstances of his work, or even its goal.
</p>
<p>
The next woe is that designing grand concepts is fun; finding
nitty little bugs is just work. With any creative activity come dreary hours of tedious, painstaking labor, and programming is no
exception.
</p>
<p>
Next, one finds that debugging has a linear convergence, or
worse, where one somehow expects a quadratic sort of approach
to the end. So testing drags on and on, the last difficult bugs taking
more time to find than the first.
</p>
<p>
The last woe, and sometimes the last straw, is that the product
over which one has labored so long appears to be obsolete upon
(or before) completion. Already colleagues and competitors are in
hot pursuit of new and better ideas. Already the displacement of
one's thought-child is not only conceived, but scheduled.
</p>
</div>
</div>

</div>
