public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">The Mythical Man-Month</h2>
<div class="outline-text-2" id="text-2">

<p>More software projects have gone awry for lack of calendar time
than for all other causes combined. Why is this cause of disaster
so common?
</p>
<p>
First, our techniques of estimating are poorly developed.
</p>
<p>
Second, our estimating techniques fallaciously confuse effort
with progress, hiding the assumption that men and months are
interchangeable.
</p>
<p>
Third, because we are uncertain of our estimates, software
managers often lack the courteous stubbornness of Antoine's chef.
</p>
<p>
Fourth, schedule progress is poorly monitored.
</p>
<p>
Fifth, when schedule slippage is recognized, the natural (and
traditional) response is to add manpower.
</p>
<p>
For some years I have been successfully using the following
rule of thumb for scheduling a software task:
</p>
<p class="verse">
l/3 planning<br/>
l/6 coding<br/>
l/4 component test and early system test<br/>
l/4 system test, all components in hand.<br/>
</p>


<p>
This differs from conventional scheduling in several important
ways:
</p>
<ol>
<li>The fraction devoted to planning is larger than normal. Even
</li>
</ol>

<p>so, it is barely enough to produce a detailed and solid specification,
and not enough to include research or exploration of
totally new techniques.
</p>
<ol>
<li>The half of the schedule devoted to debugging of completed
</li>
</ol>

<p>code is much larger than normal.
</p>
<ol>
<li>The part that is easy to estimate, i.e., coding, is given only
</li>
</ol>

<p>one-sixth of the schedule.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The Surgical Team</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Mills's Proposal</h3>
<div class="outline-text-3" id="text-3-1">

<p>Mills proposes that each segment of a large job be tackled
by a team, but that the team be organized like a surgical team
rather than a hog-butchering team. That is, instead of each member
cutting away on the problem, one does the cutting and the
others give him every support that will enhance his effectiveness
and productivity.
</p>
<p>
The surgeon. Mills calls him a chief programmer. He personally
defines the functional and performance specifications, designs the
program, codes it, tests it, and writes its documentation.
</p>
<p>
The copilot. He is the alter ego of the surgeon, able to do any
part of the job, but is less experienced. His main function is to
share in the design as a thinkerrdiscussant, and evaluator. The
surgeon tries ideas on him, but is not bound by his advice. The
copilot often represents his team in discussions of function and
interface with other teams. He knows all the code intimately. He
researches alternative design strategies. He obviously serves as
insurance against disaster to the surgeon. He may even write code,
but he is not responsible for any part of the code.
</p>
<p>
The administrator. The surgeon is boss, and he must have the
last word on personnel, raises, space, and so on, but he must spend
almost none of his time on these matters. Thus he needs a professional
administrator who handles money, people, space, and machines,
and who interfaces with the administrative machinery of
the rest of the organization. Baker suggests that the administrator
has a full-time job only if the project has substantial legal, contractual,
reporting, or financial requirements because of the userproducer
relationship. Otherwise, one administrator can serve two
teams.
</p>
<p>
The editor. The surgeon is responsible for generating the documentation—
for maximum clarity he must write it. This is true of
both external and internal descriptions. The editor, however, takes
the draft or dictated manuscript produced by the surgeon and
criticizes it, reworks it, provides it with references and bibliography,
nurses it through several versions, and oversees the mechanics
of production.
</p>
<p>
Two secretaries. The administrator and the editor will each need
a secretary; the administrator's secretary will handle project correspondence
and non-product files.
</p>
<p>
The program clerk. He is responsible for maintaining all the
technical records of the team in a programming-product library.
The clerk is trained as a secretary and has responsibility for both
machine-readable and human-readable files.
</p>
<p>
The toolsmith. File-editing, text-editing, and interactive debugging
services are now readily available, so that a team will rarely
need its own machine and machine-operating crew. But these
services must be available with unquestionably satisfactory response
and reliability; and the surgeon must be sole judge of the
adequacy of the service available to him. He needs a toolsmith,
responsible for ensuring this adequacy of the basic service and for
constructing, maintaining, and upgrading special tools—mostly
interactive computer services—needed by his team. Each team will
need its own toolsmith, regardless of the excellence and reliability
of any centrally provided service, for his job is to see to the tools
needed or wanted by his surgeon, without regard to any other
team's needs. The tool-builder will often construct specialized
utilities, catalogued procedures, macro libraries.
</p>
<p>
The tester. The surgeon will need a bank of suitable test cases
for testing pieces of his work as he writes it, and then for testing
the whole thing.
</p>
<p>
The language lawyer. By the time Algol came along, people
began to recognize that most computer installations have one or
two people who delight in mastery of the intricacies of a programming
language.
</p>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">How It Works</h3>
<div class="outline-text-3" id="text-3-2">

<p>Notice in particular the differences between a team of two
programmers conventionally organized and the surgeon-copilot
team. First, in the conventional team the partners divide the work,
and each is responsible for design and implementation of part of
the work. In the surgical team, the surgeon and copilot are each
cognizant of all of the design and all of the code. This saves the
labor of allocating space, disk accesses, etc. It also ensures the
conceptual integrity of the work.
</p>
<p>
 In the surgical team, there are no
differences of interest, and differences of judgment are settled by
the surgeon unilaterally. These two differences—lack of division
of the problem and the superior-subordinate relationship—make
it possible for the surgical team to act uno animo.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Aristocracy, Democracy, and System Design</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Conceptual Integrity</h3>
<div class="outline-text-3" id="text-4-1">

<p>I will contend that conceptual integrity is the most important
consideration in system design. It is better to have a system omit
certain anomalous features and improvements, but to reflect one
set of design ideas, than to have one that contains many good but
independent and uncoordinated ideas.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Achieving Conceptual Integrity</h3>
<div class="outline-text-3" id="text-4-2">

<p>Because ease of use is the purpose, this ratio of function to
conceptual complexity is the ultimate test of system design. Nei-
ther function alone nor simplicity alone defines a good design.
</p>
<p>
Simplicity and straightfor-
wardness proceed from conceptual integrity. Every part must re-
flect the same philosophies and the same balancing of desiderata.
Every part must even use the same techniques in syntax and
analogous notions in semantics. Ease of use, then, dictates unity
of design, conceptual integrity.
</p>
</div>

</div>
