public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Aristocracy and Democracy</h3>
<div class="outline-text-3" id="text-4-3">

<p>Conceptual integrity in turn dictates that the design must proceed
from one mind, or from a very small number of agreeing resonant
minds.
</p>
<p>
Schedule pressures, however, dictate that system building
needs many hands. Two techniques are available for resolving this
dilemma. The first is a careful division of labor between architec-
ture and implementation. The second is the new way of structur-
ing programming implementation teams discussed in the previous
chapter.
</p>
<p>
The separation of architectural effort from implementation is
a very powerful way of getting conceptual integrity on very large
projects.
</p>
<p>
By the architecture of a system, I mean the complete and de-
tailed specification of the user interface. For a computer this is the
programming manual. For a compiler it is the language manual. For
a control program it is the manuals for the language or languages
used to invoke its functions. For the entire system it is the union
of the manuals the user must consult to do his entire job.
</p>
<p>
Architecture must be carefully distinguished from implemen-
tation. As Blaauw has said, "Where architecture tells what hap-
pens, implementation tells how it is made to happen."
</p>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">What Does the Implementer Do While Waiting?</h3>
<div class="outline-text-3" id="text-4-4">

<p>The architecture manager had 10 good men. He asserted that
they could write the specifications and do it right.
</p>
<p>
The control program manager had 150 men. He asserted that
they could prepare the specifications, with the architecture team
coordinating; it would be well-done and practical, and he could do
it on schedule. 
</p>
<p>
As Blaauw points out, the total creative effort involves three
distinct phases: architecture, implementation, and realization. It
turns out that these can in fact be begun in parallel and proceed
simultaneously.
</p>
<p>
In computer design, for example, the implementer can start as
soon as he has relatively vague assumptions about the manual,
somewhat clearer ideas about the technology, and well-defined
cost and performance objectives. He can begin designing data
flows, control sequences, gross packaging concepts, and so on. He
devises or adapts the tools he will need, especially the record-
keeping system, including the design automation system.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">The Second-System Effect</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Interactive Discipline for the Architect</h3>
<div class="outline-text-3" id="text-5-1">

<p>The architect has two possible answers when confronted with
an estimate that is too high: cut the design or challenge the esti-
mate by suggesting cheaper implementations. This latter is inher-
ently an emotion-generating activity. The architect is now
challenging the builder's way of doing the builder's job. For it to
be successful, the architect must
• remember that the builder has the inventive and creative re-
sponsibility for the implementation; so the architect suggests,
not dictates;
• always be prepared to suggest a way of implementing any-
thing he specifies, and be prepared to accept any other way
that meets the objectives as well;
• deal quietly and privately in such suggestions;
• be ready to forego credit for suggested improvements.
</p></div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">Self-Discipline—The Second-System Effect</h3>
<div class="outline-text-3" id="text-5-2">

<p>How does the architect avoid the second-system effect? Well,
obviously he can't skip his second system. But he can be conscious
of the peculiar hazards of that system, and exert extra self-disci-
pline to avoid functional ornamentation and to avoid extrapola-
tion of functions that are obviated by changes in assumptions and
purposes.
</p>
<p>
A discipline that will open an architect's eyes is to assign each
little function a value: capability x is worth not more than m bytes
of memory and n microseconds per invocation. These values will
guide initial decisions and serve during implementation as a guide
and warning to all.
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Passing the Word</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Written Specifications—the Manual</h3>
<div class="outline-text-3" id="text-6-1">

<p>I think the finest piece of manual writing I have ever seen is
Blaauw's Appendix to System/360 Principles of Operation. This de-
scribes with care and precision the limits of System/360 compati-
bility. It defines compatibility, prescribes what is to be achieved,
and enumerates those areas of external appearance where the ar-
chitecture is intentionally silent and where results from one model
may differ from those of another, where one copy of a given model
may differ from another copy, or where a copy may differ even
from itself after an engineering change. This is the level of preci-
sion to which manual writers aspire, and they must define what
is not prescribed as carefully as what is.
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">Formal Definitions</h3>
<div class="outline-text-3" id="text-6-2">

<p>English, or any other human language, is not naturally a precision
instrument for such definitions. Therefore the manual writer must
strain himself and his language to achieve the precision needed.
An attractive alternative is to use a formal notation for such definitions. 
</p>
<p>
An ancient adage warns, "Never go to sea with two chronom-
eters; take one or three." The same thing clearly applies to prose
and formal definitions. If one has both, one must be the standard,
and the other must be a derivative description, clearly labeled as
such. Either can be the primary standard. Algol 68 has a formal
definition as standard and a prose definition as descriptive. PL/I
has the prose as standard and the formal description as derivative.
</p>
<p>
Many tools are available for formal definition. The Backus-
Naur Form is familiar for language definition, and it is amply
discussed in the literature.<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup> The formal description of PL/I uses
new notions of abstract syntax, and it is adequately described.<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup>
Iverson's APL has been used to describe machines, most notably
the IBM 7090<sup><a class="footref" name="fnr-.3" href="#fn-.3">3</a></sup> and System/360.<sup><a class="footref" name="fnr-.4" href="#fn-.4">4</a></sup>
</p>
<p>
Bell and Newell have proposed new notations for describing
both configurations and machine architectures, and they have il-
lustrated these with several machines, including the DEC PDP-8,<sup><a class="footref" name="fnr-.5" href="#fn-.5">5</a></sup>
the 7090<sup><a class="footref" name="fnr-.5.2" href="#fn-.5">5</a></sup>, and System/360.<sup><a class="footref" name="fnr-.6" href="#fn-.6">6</a></sup>
</p>
<p>
t is an implementation; it
runs. So all questions of definition can be resolved by testing it.
</p>
<p>
Using an implementation as a definition has some advantages.
All questions can be settled unambiguously by experiment. De-
bate is never needed, so answers are quick. Answers are always as
precise as one wants, and they are always correct, by definition.
</p>

<p>
The implementation as a definition overprescribed; it not only said what the machine must do, it also said a
great deal about how it had to do it.
</p>
<p>
Then, too, the implementation will sometimes give unex-
pected and unplanned answers when sharp questions are asked,
and the de facto definition will often be found to be inelegant in
these particulars precisely because they have never received any
thought. 
</p>
<p>
Finally, the use of an implementation as a formal definition is
peculiarly susceptible to confusion as to whether the prose de-
scription or the formal description is in fact the standard. This is
especially true of programmed simulations.
</p>
</div>

</div>
