public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">Direct Incorporation</h3>
<div class="outline-text-3" id="text-6-3">

<p>It is especially useful
for establishing the syntax, if not the semantics, of intermodule
interfaces. This technique is to design the declaration of the passed
parameters or shared storage, and to require the implementations
to include that declaration via a compile-time operation (a macro
or a % INCLUDE in PL/I). 
</p></div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">Conferences and Courts</h3>
<div class="outline-text-3" id="text-6-4">

<p>A new problem
is usually discussed a while. The emphasis is on creativity, rather
than merely decision. The group attempts to invent many solu-
tions to problems, then a few solutions are passed to one or more
of the architects for detailing into precisely worded manual change
proposals.
</p>
<p>
The fruitfulness of these meetings springs from several
sources:
</p><ol>
<li>The same group—architects, users, and implementers—meets weekly for
   months. No time is needed for bringing people up to date.
</li>
<li>The group is bright, resourceful, well versed in the issues, and
   deeply involved in the outcome. No one has an "advisory" role. Everyone is authorized to make binding commitments.
</li>
<li>When problems are raised, solutions are sought both within and outside the obvious boundaries.
</li>
<li>The formality of written proposals focuses attention, forces decision, and avoids committee-drafted inconsistencies.
</li>
<li>The clear vesting of decision-making power in the chief architect avoids compromise and delay.
</li>
</ol>


</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5">The Telephone Log</h3>
<div class="outline-text-3" id="text-6-5">

<p>One useful mechanism is a telephone log kept by the architect.
In it he records every question and every answer. Each week the
logs of the several architects are concatenated, reproduced, and
distributed to the users and implementers. While this mechanism
is quite informal, it is both quick and comprehensive.
</p></div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6">Product Test</h3>
<div class="outline-text-3" id="text-6-6">

<p>Time after time, the careful product tester will find
places where the word didn't get passed, where the design deci-
sions were not properly understood or accurately implemented.
For this reason such a testing group is a necessary link in the chain
by which the design word is passed, a link that needs to operate
early and simultaneously with design.
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Why Did the Tower of Babel Fail?</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">A Management Audit of the Babel Project</h3>
<div class="outline-text-3" id="text-7-1">

<p> In two respects—communication, and its con-
sequent, organization. They were unable to talk with each other;
hence they could not coordinate. When coordination failed, work
ground to a halt. Reading between the lines we gather that lack
of communication led to disputes, bad feelings, and group jeal-
ousies. Shortly the clans began to move apart, preferring isolation
to wrangling.
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">Communication in the Large Programming Project</h3>
<div class="outline-text-3" id="text-7-2">

<p>How, then, shall teams communicate with one another? In as
many ways as possible.
</p><ul>
<li>Informally. Good telephone service and a clear definition of
  intergroup dependencies will encourage the hundreds of calls upon
  which common interpretation of written documents depends.
</li>
<li>Meetings. Regular project meetings, with one team after another
  giving technical briefings, are invaluable. Hundreds of minor misunderstandings get smoked out this way.
</li>
<li>Workbook. A formal project workbook must be started at the beginning. This deserves a section by itself.
</li>
</ul>


</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">The Project Workbook</h3>
<div class="outline-text-3" id="text-7-3">

<p>What. All the documents of the project need to be part of this struc-
ture. This includes objectives, external specifications, interface
specifications, technical standards, internal specifications, and ad-
ministrative memoranda.
</p>
<p>
Why. Technical prose is almost immortal. If one examines the
genealogy of a customer manual for a piece of hardware or soft-
ware, one can trace not only the ideas, but also many of the very
sentences and paragraphs back to the first memoranda proposing
the product or explaining the first design.
</p>
<p>
it is very important to get the
structure of the documentation right. The early design of the
project workbook ensures that the documentation structure itself
is crafted, not haphazard. Moreover, the establishment of a struc-
ture molds later writing into segments that fit into that structure.
</p>
<p>
The second reason for the project workbook is control of the
distribution of information.
</p>
<p>
Mechanics. First, one must
mark changed text on the page, e.g., by a vertical bar in the margin
alongside every altered line. Second, one needs to distribute with
the new pages a short, separately written change summary that
lists the changes and remarks on their significance.
</p>
<p>
On balance I think the microfiche was a very happy mecha-
nism, and I would recommend it over a paper workbook for very
large projects.
</p>
<p>
How would one do it today? With today's system technology
available, I think the technique of choice is to keep the workbook
on the direct-access file, marked with change bars and revision
dates. Each user would consult it from a display terminal
</p>
</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">Organization in the Large Programming Project</h3>
<div class="outline-text-3" id="text-7-4">

<p>If there are n workers on a project, there are (n<sup>2</sup>-n)/2 interfaces
across which there may be communication, and there are poten-
tially almost 2<sup>n</sup> teams within which coordination must occur. The
purpose of organization is to reduce the amount of communication and coordination necessary; hence organization is a radical attack
on the communication problems treated above.
</p>
<p>
The means by which communication is obviated are division of
labor and specialization of function. The tree-like structure of orga-
nizations reflects the diminishing need for detailed communica-
tion when division and specialization of labor are applied.
</p>
<p>
Let us consider a tree-like programming organization, and
examine the essentials which any subtree must have in order to be
effective. They are:
</p><ol>
<li>a mission
</li>
<li>a producer
</li>
<li>a technical director or architect
</li>
<li>a schedule
</li>
<li>a division of labor
</li>
<li>interface definitions among the parts
</li>
</ol>


<p>
What is the role of the producer? He assembles the team,
divides the work, and establishes the schedule. He acquires and
keeps on acquiring the necessary resources.This means that a
major part of his role is communication outside the team, upwards
and sideways. He establishes the pattern of communication and
reporting within the team. Finally, he ensures that the schedule is
met, shifting resources and organization to respond to changing
circumstances.
</p>
<p>
How about the technical director? He conceives of the design
to be built, identifies its subparts, specifies how it will look from
outside, and sketches its internal structure. He provides unity and
conceptual integrity to the whole design; thus he serves as a limit
on system complexity. As individual technical problems arise, he
invents solutions for them or shifts the system design as required.
</p>
<p>
The producer and the technical director may be the same man.
This is readily workable on very small teams, perhaps three to six
programmers. On larger projects it is very rarely workable, for two
reasons. First, the man with strong management talent and strong
technical talent is rarely found. Thinkers are rare; doers are rarer;
and thinker-doers are rarest.
</p>
<p>
The producer may be boss, the director his right-hand man.
</p>
<p>
The director may be boss, and the producer his right-hand man.
</p></div>
</div>

</div>
