src/Books Review/The Mythical Man-Month/The Mythical Man-Month.org
* Calling the Shot
#+begin_verse
Practice is the best of all instructors.
                             PUBUUUS
Experience is a dear teacher, but fools will learn at no other.b
                         POOR RICHARD'S ALMANAC
#+end_verse
How long will a system programming job take? How much effort
will be required? How does one estimate?

First, one must say
that one does not estimate the entire task by estimating the coding
portion only and then applying the ratios. The coding is only
one-sixth or so of the problem, and errors in its estimate or in the
ratios could lead to ridiculous'results.

Second, one must say that data for building isolated small
programs are not applicable to programming systems products.
Planning, documentation, testing, system integration,
and training times must be added. The linear extrapolation of such
sprint figures is meaningless. Extrapolation of times for the hun-
dred-yard dash shows that a man can run a mile in under three
minutes.

Before dismissing them, however, let us note that these num-
bers, although not for strictly comparable problems, suggest that
effort goes as a power of size even when no communication is
involved except that of a man with his memories.

It illustrates results reported from
a study done by Nanus and Farr[fn:7] at System Development Corpo-
ration. This shows an exponent of 1.5; that is,

effort = (constant) X (number of instructions)^1.5.

Another SDC study reported by Weinwurm3 also shows an expo-
nent near 1.5.

Morin has prepared a survey of the published data.[fn:8]

* Ten Pounds in a Five-Pound Sack
** Program Space as Cost
Since size is such a large part of the user cost of a programming
system product, the builder must set size targets, control size, and
devise size-reduction techniques, just as the hardware builder sets
component-count targets, controls component count, and devises
count-reduction techniques. Like any cost, size itself is not bad,
but unnecessary size is.
** Size Control
First, setting size targets for core is not enough; one has to
budget all aspects of size. 

So the second moral is also clear: Define exactly what a
module must do when you specify how big it must be.

A third and deeper lesson shows through these experiences.
All during implementation, the
system architects must maintain continual vigilance to ensure con-
tinued system integrity. Beyond this policing mechanism, how-
ever, lies the matter of attitude of the implementers themselves.
Fostering a total-system, user-oriented attitude may well be the
most important function of the programming manager.

** Space Techniques
Obviously, more function means more space, speed being held
constant. So the first area of craftsmanship is in trading function
for size. One can design
a program with many optional features, each of which takes a little
space. One can design a generator that will take an option Jist and
tailor a program to it. So the designer must decide how fine-grained the user
choice of options will be.

The second area of craftsmanship is space-time trade-offs. For
a given function, the more space, the faster. This is true over an
amazingly large range. It is this fact that makes it feasible to set
space budgets.

The manager can do two things to help his team make good
space-time trade-offs. One is to ensure that they are trained in
programming technique, not just left to rely on native wit and
previous experience.

The second is to recognize that programming has a technol-
ogy, and components need to be fabricated. Every project needs
a notebook full of good subroutines or macros for queuing, search-
ing, hashing, and sorting. For each such function the notebook
should have at least two programs, the quick and the squeezed.

** Representation Is the Essence of Programming
The programmer at wit's end for lack of space can often do
best by disentangling himself from his code, rearing back, and
contemplating his data. Representation is the essence of program-
ming.
* The Documentary Hypothesis
** Documents for a Computer Product
Suppose one is building a machine. What are the critical documents?

+ Objectives. This defines the need to be met and the goals, desiderata, constraints, and priorities.
+ Specifications. This is a computer manual plus performance specifications. It is one of the first documents generated in propos- ing a new product, and the last document finished.
+ Schedule
+ Budget. Not merely a constraint, the budget is one of the manager's
  most useful documents. Existence of the budget forces technical decisions that otherwise would be avoided; and, more important, it forces and clarifies policy decisions.
+ Organization chart
+ Space allocations
+ Estimate, forecast, prices. These three have cyclic Interlocking, which determines the success or failure of the project.
** Documents for a University Department
#+begin_src sh
Objectives
Course descriptions
Degree requirements
Research proposals (hence plans, when funded)
Class schedule and teaching assignments
Budget
Space allocation
Assignment of staff and graduate students
#+end_src
** Documents for a Software Project
+ What: objectives. This defines the need to be met and the goals, desiderata, constraints, and priorities.
+ What: product specifications. This begins as a proposal and ends up
  as the manual and internal documentation. Speed and space specifications are a critical part.
+ When: schedule
+ How much: budget
+ Where: space allocation
+ Who: organization chart.
** Why Have Formal Documents?
First, writing the decisions down is essential. 
The act
of writing turns out to require hundreds of mini-decisions, and it
is the existence of these that distinguishes clear, exact policies
from fuzzy ones.

Second, the documents will communicate the decisions to others.

Finally, a manager's documents give him a data base and
checklist. 

* Plan to Throw One Away
** Pilot Plants and Scaling Up
Hence plan to throw one away; you will, anyhow.
** The Only Constancy Is Change Itself
Nevertheless, some changes in objectives are inevitable, and it
is better to be prepared for them than to assume that they won't
come. Not only are changes in objective inevitable, changes in
development strategy and technique are also inevitable. The
throw-one-away concept is itself just an acceptance of the fact
that as one learns, he changes the design.[fn:9]
