public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Calling the Shot</h2>
<div class="outline-text-2" id="text-8">


<p class="verse">
Practice is the best of all instructors.<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PUBUUUS<br/>
Experience is a dear teacher, but fools will learn at no other.b<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; POOR RICHARD'S ALMANAC<br/>
</p>


<p>
How long will a system programming job take? How much effort
will be required? How does one estimate?
</p>
<p>
First, one must say
that one does not estimate the entire task by estimating the coding
portion only and then applying the ratios. The coding is only
one-sixth or so of the problem, and errors in its estimate or in the
ratios could lead to ridiculous'results.
</p>
<p>
Second, one must say that data for building isolated small
programs are not applicable to programming systems products.
Planning, documentation, testing, system integration,
and training times must be added. The linear extrapolation of such
sprint figures is meaningless. Extrapolation of times for the hun-
dred-yard dash shows that a man can run a mile in under three
minutes.
</p>
<p>
Before dismissing them, however, let us note that these num-
bers, although not for strictly comparable problems, suggest that
effort goes as a power of size even when no communication is
involved except that of a man with his memories.
</p>
<p>
It illustrates results reported from
a study done by Nanus and Farr<sup><a class="footref" name="fnr-.7" href="#fn-.7">7</a></sup> at System Development Corpo-
ration. This shows an exponent of 1.5; that is,
</p>
<p>
effort = (constant) X (number of instructions)<sup>1</sup>.5.
</p>
<p>
Another SDC study reported by Weinwurm3 also shows an expo-
nent near 1.5.
</p>
<p>
Morin has prepared a survey of the published data.<sup><a class="footref" name="fnr-.8" href="#fn-.8">8</a></sup>
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Ten Pounds in a Five-Pound Sack</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">Program Space as Cost</h3>
<div class="outline-text-3" id="text-9-1">

<p>Since size is such a large part of the user cost of a programming
system product, the builder must set size targets, control size, and
devise size-reduction techniques, just as the hardware builder sets
component-count targets, controls component count, and devises
count-reduction techniques. Like any cost, size itself is not bad,
but unnecessary size is.
</p></div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2">Size Control</h3>
<div class="outline-text-3" id="text-9-2">

<p>First, setting size targets for core is not enough; one has to
budget all aspects of size. 
</p>
<p>
So the second moral is also clear: Define exactly what a
module must do when you specify how big it must be.
</p>
<p>
A third and deeper lesson shows through these experiences.
All during implementation, the
system architects must maintain continual vigilance to ensure con-
tinued system integrity. Beyond this policing mechanism, how-
ever, lies the matter of attitude of the implementers themselves.
Fostering a total-system, user-oriented attitude may well be the
most important function of the programming manager.
</p>
</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3">Space Techniques</h3>
<div class="outline-text-3" id="text-9-3">

<p>Obviously, more function means more space, speed being held
constant. So the first area of craftsmanship is in trading function
for size. One can design
a program with many optional features, each of which takes a little
space. One can design a generator that will take an option Jist and
tailor a program to it. So the designer must decide how fine-grained the user
choice of options will be.
</p>
<p>
The second area of craftsmanship is space-time trade-offs. For
a given function, the more space, the faster. This is true over an
amazingly large range. It is this fact that makes it feasible to set
space budgets.
</p>
<p>
The manager can do two things to help his team make good
space-time trade-offs. One is to ensure that they are trained in
programming technique, not just left to rely on native wit and
previous experience.
</p>
<p>
The second is to recognize that programming has a technol-
ogy, and components need to be fabricated. Every project needs
a notebook full of good subroutines or macros for queuing, search-
ing, hashing, and sorting. For each such function the notebook
should have at least two programs, the quick and the squeezed.
</p>
</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4">Representation Is the Essence of Programming</h3>
<div class="outline-text-3" id="text-9-4">

<p>The programmer at wit's end for lack of space can often do
best by disentangling himself from his code, rearing back, and
contemplating his data. Representation is the essence of program-
ming.
</p></div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">The Documentary Hypothesis</h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1">Documents for a Computer Product</h3>
<div class="outline-text-3" id="text-10-1">

<p>Suppose one is building a machine. What are the critical documents?
</p>
<ul>
<li>Objectives. This defines the need to be met and the goals, desiderata, constraints, and priorities.
</li>
<li>Specifications. This is a computer manual plus performance specifications. It is one of the first documents generated in propos- ing a new product, and the last document finished.
</li>
<li>Schedule
</li>
<li>Budget. Not merely a constraint, the budget is one of the manager's
  most useful documents. Existence of the budget forces technical decisions that otherwise would be avoided; and, more important, it forces and clarifies policy decisions.
</li>
<li>Organization chart
</li>
<li>Space allocations
</li>
<li>Estimate, forecast, prices. These three have cyclic Interlocking, which determines the success or failure of the project.
</li>
</ul>

</div>

</div>

<div id="outline-container-10-2" class="outline-3">
<h3 id="sec-10-2">Documents for a University Department</h3>
<div class="outline-text-3" id="text-10-2">




<pre class="src src-sh">Objectives
Course descriptions
Degree requirements
Research proposals (hence plans, when funded)
Class schedule and teaching assignments
Budget
Space allocation
Assignment of staff and graduate students
</pre>

</div>

</div>

<div id="outline-container-10-3" class="outline-3">
<h3 id="sec-10-3">Documents for a Software Project</h3>
<div class="outline-text-3" id="text-10-3">

<ul>
<li>What: objectives. This defines the need to be met and the goals, desiderata, constraints, and priorities.
</li>
<li>What: product specifications. This begins as a proposal and ends up
  as the manual and internal documentation. Speed and space specifications are a critical part.
</li>
<li>When: schedule
</li>
<li>How much: budget
</li>
<li>Where: space allocation
</li>
<li>Who: organization chart.
</li>
</ul>

</div>

</div>

<div id="outline-container-10-4" class="outline-3">
<h3 id="sec-10-4">Why Have Formal Documents?</h3>
<div class="outline-text-3" id="text-10-4">

<p>First, writing the decisions down is essential. 
The act
of writing turns out to require hundreds of mini-decisions, and it
is the existence of these that distinguishes clear, exact policies
from fuzzy ones.
</p>
<p>
Second, the documents will communicate the decisions to others.
</p>
<p>
Finally, a manager's documents give him a data base and
checklist. 
</p>
</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">Plan to Throw One Away</h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1">Pilot Plants and Scaling Up</h3>
<div class="outline-text-3" id="text-11-1">

<p>Hence plan to throw one away; you will, anyhow.
</p></div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2">The Only Constancy Is Change Itself</h3>
<div class="outline-text-3" id="text-11-2">

<p>Nevertheless, some changes in objectives are inevitable, and it
is better to be prepared for them than to assume that they won't
come. Not only are changes in objective inevitable, changes in
development strategy and technique are also inevitable. The
throw-one-away concept is itself just an acceptance of the fact
that as one learns, he changes the design.<sup><a class="footref" name="fnr-.9" href="#fn-.9">9</a></sup>
</p></div>

</div>
