src/Books Review/The Mythical Man-Month/The Mythical Man-Month.org
** Plan the System for Change
Quantization of change is an essential technique. Every prod-
uct should have numbered versions, and each version must have
its own schedule and a freeze date, after which changes go into the
next version.
** Plan the Organization for Change
Cosgrove advocates treating all plans, milestones, and schedules as
tentative, so as to facilitate change. This goes much too far—the
common failing of programming groups today is too little manage-
ment control, not too much.

Structuring an organization for change is much harder than
designing a system for change. Each man must be assigned to jobs
that broaden him, so that the whole force is technically flexible.
** One Step Forward and One Step Back
They find that the total number of
modules increases linearly with release number, but that the num-
ber of modules affected increases exponentially with release num-
ber. All repairs tend to destroy the structure, to increase the
entropy and disorder of the system. Less and less effort is spent
on fixing original design flaws; more and more is spent on fixing
flaws introduced by earlier fixes. As time passes, the system
becomes less and less well-ordered. Sooner or later the fixing
ceases to gain any ground. Each forward step is matched by a
backward one.
* Sharp Tools
Both specialized needs and personal preferences dictate the need for special-
ized tools as well; so in discussing programming teams I have
postulated one toolmaker per team. This man masters all the com-
mon tools and is able to instruct his client-boss in their use. He
also builds the specialized tools his boss needs.

What are the tools about which the manager must philoso-
phize, plan, and organize? First, a computer facility. This requires
machines, and a scheduling philosophy must be adopted. It requires an operating system, and service philosophies must be estab-
lished. It requires language, and a language policy must be laid
down. Then there are utilities, -debugging aids, test-case generators,
and a text-processing system to handle documentation. Let us look
at these one by one.[fn:10]
** Target Machines
Machine support is usefully divided into the target machine and the
vehicle machines. 
** Scheduling.
System debugging has always been a graveyard-shift occupation,
like astronomy. 
** Vehicle Machines and Data Services
Simulators. If the target computer is new, one needs a logical
simulator for it. This gives a debugging vehicle long before the real
target exists. Equally important, it gives access to a dependable
debugging vehicle even after one has a target machine available.

 So a dependable
simulator on a well-aged vehicle retains its usefulness far longer
than one would expect.

** Compiler and assembler vehicles. 
For the same reasons, one
wants compilers and assemblers that run on dependable vehicles
but compile object code for the target system. This can then start
being debugged on the simulator.

** Program libraries and accounting. 
First, each group or programmer had an area where he kept
copies of his programs, his test cases, and the scaffolding he
needed for component testing. In this playpen area there were no
restrictions on what a man could do with his own programs; they
were his.

Two notions are important here. The first is control, the idea
of program copies belonging to managers who alone can authorize
their change. The"second is that of formal separation and progression
from the playpen, to integration, to release.

** Program tools.
** Documentation system. 
Among all tools, the one that saves the
most labor may well be a computerized text-editing system, oper-
ating on a dependable vehicle.

** Performance simulator. 
Better have one. Build it outside-in. Start it very early. Listen to it when it speaks.
** High-Level Language and Interactive Programming
+ High-level language. The chief reasons for using a high-level
  language are productivity and debugging speed.

+ Interactive programming. There is a widespread recognition that
  debugging is the hard and slow part of system programming, and slow
  turnaround is the bane of debugging. So the logic of interactive
  programming seems inexorable.

* The Whole and the Parts
** Designing the Bugs Out
*** Bug-proofing the definition. 
The most pernicious and subtle bugs are
  system bugs arising from mismatched assumptions made by the authors
  of various components. Careful function definition, careful
  specification, and the disciplined exorcism of frills of function
  and flights of technique all reduce the number of system bugs that
  have to be found.
*** Testing the specification.
 Long before any code exists, the spec-
  ification must be handed to an outside testing group to be scruti-
  nized for completeness and clarity.
*** Top-down design.
 Niklaus Wirth formalized a design procedure which
  had been used for years by the best programmers.[fn:11] Briefly,
  Wirth's procedure is to identify design as a sequence of refinement
  steps. 

From this process one identifies modules of solution or of
  data whose further refinement can proceed independently of other
  work. The degree of this modularity determines the adaptability and
  changeability of the program.

A good top-down design avoids bugs in several ways. First, the clarity
of structure and representation makes the precise state- ment of
requirements and functions of the modules easier. Second, the
partitioning and independence of modules avoids system bugs. Third,
the suppression of detail makes flaws in the structure more apparent.
Fourth, the design can be tested at each of its refinement steps, so
testing can start earlier and focus on the proper level of detail at
each step.

*** Structured programming.
Another important set of new ideas for designing the bugs out of
programs derives largely from Dijkstra[fn:12], and is built on a theoretical
structure by Bohm and Jacopini[fn:13]. 

The important point, and the one vital to constructing bug- free
programs, is that one wants to think about the control struc- tures of
a system as control structures, not as individual branch statements.
This way of thinking is a major step forward.

** Component Debugging
*** On-machine debugging.
*** Memorydumps. 
*** Snapshots.
So people developed techniques for selective dumping, selective
tracing, and for inserting snapshots into programs. 
*** Interactive debugging. 
