public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3">Plan the System for Change</h3>
<div class="outline-text-3" id="text-11-3">

<p>Quantization of change is an essential technique. Every prod-
uct should have numbered versions, and each version must have
its own schedule and a freeze date, after which changes go into the
next version.
</p></div>

</div>

<div id="outline-container-11-4" class="outline-3">
<h3 id="sec-11-4">Plan the Organization for Change</h3>
<div class="outline-text-3" id="text-11-4">

<p>Cosgrove advocates treating all plans, milestones, and schedules as
tentative, so as to facilitate change. This goes much too far—the
common failing of programming groups today is too little manage-
ment control, not too much.
</p>
<p>
Structuring an organization for change is much harder than
designing a system for change. Each man must be assigned to jobs
that broaden him, so that the whole force is technically flexible.
</p></div>

</div>

<div id="outline-container-11-5" class="outline-3">
<h3 id="sec-11-5">One Step Forward and One Step Back</h3>
<div class="outline-text-3" id="text-11-5">

<p>They find that the total number of
modules increases linearly with release number, but that the num-
ber of modules affected increases exponentially with release num-
ber. All repairs tend to destroy the structure, to increase the
entropy and disorder of the system. Less and less effort is spent
on fixing original design flaws; more and more is spent on fixing
flaws introduced by earlier fixes. As time passes, the system
becomes less and less well-ordered. Sooner or later the fixing
ceases to gain any ground. Each forward step is matched by a
backward one.
</p></div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Sharp Tools</h2>
<div class="outline-text-2" id="text-12">

<p>Both specialized needs and personal preferences dictate the need for special-
ized tools as well; so in discussing programming teams I have
postulated one toolmaker per team. This man masters all the com-
mon tools and is able to instruct his client-boss in their use. He
also builds the specialized tools his boss needs.
</p>
<p>
What are the tools about which the manager must philoso-
phize, plan, and organize? First, a computer facility. This requires
machines, and a scheduling philosophy must be adopted. It requires an operating system, and service philosophies must be estab-
lished. It requires language, and a language policy must be laid
down. Then there are utilities, -debugging aids, test-case generators,
and a text-processing system to handle documentation. Let us look
at these one by one.<sup><a class="footref" name="fnr-.10" href="#fn-.10">10</a></sup>
</p>
</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1">Target Machines</h3>
<div class="outline-text-3" id="text-12-1">

<p>Machine support is usefully divided into the target machine and the
vehicle machines. 
</p></div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2">Scheduling.</h3>
<div class="outline-text-3" id="text-12-2">

<p>System debugging has always been a graveyard-shift occupation,
like astronomy. 
</p></div>

</div>

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3">Vehicle Machines and Data Services</h3>
<div class="outline-text-3" id="text-12-3">

<p>Simulators. If the target computer is new, one needs a logical
simulator for it. This gives a debugging vehicle long before the real
target exists. Equally important, it gives access to a dependable
debugging vehicle even after one has a target machine available.
</p>
<p>
 So a dependable
simulator on a well-aged vehicle retains its usefulness far longer
than one would expect.
</p>
</div>

</div>

<div id="outline-container-12-4" class="outline-3">
<h3 id="sec-12-4">Compiler and assembler vehicles.</h3>
<div class="outline-text-3" id="text-12-4">

<p>For the same reasons, one
wants compilers and assemblers that run on dependable vehicles
but compile object code for the target system. This can then start
being debugged on the simulator.
</p>
</div>

</div>

<div id="outline-container-12-5" class="outline-3">
<h3 id="sec-12-5">Program libraries and accounting.</h3>
<div class="outline-text-3" id="text-12-5">

<p>First, each group or programmer had an area where he kept
copies of his programs, his test cases, and the scaffolding he
needed for component testing. In this playpen area there were no
restrictions on what a man could do with his own programs; they
were his.
</p>
<p>
Two notions are important here. The first is control, the idea
of program copies belonging to managers who alone can authorize
their change. The"second is that of formal separation and progression
from the playpen, to integration, to release.
</p>
</div>

</div>

<div id="outline-container-12-6" class="outline-3">
<h3 id="sec-12-6">Program tools.</h3>
<div class="outline-text-3" id="text-12-6">

</div>

</div>

<div id="outline-container-12-7" class="outline-3">
<h3 id="sec-12-7">Documentation system.</h3>
<div class="outline-text-3" id="text-12-7">

<p>Among all tools, the one that saves the
most labor may well be a computerized text-editing system, oper-
ating on a dependable vehicle.
</p>
</div>

</div>

<div id="outline-container-12-8" class="outline-3">
<h3 id="sec-12-8">Performance simulator.</h3>
<div class="outline-text-3" id="text-12-8">

<p>Better have one. Build it outside-in. Start it very early. Listen to it when it speaks.
</p></div>

</div>

<div id="outline-container-12-9" class="outline-3">
<h3 id="sec-12-9">High-Level Language and Interactive Programming</h3>
<div class="outline-text-3" id="text-12-9">

<ul>
<li>High-level language. The chief reasons for using a high-level
  language are productivity and debugging speed.

</li>
<li>Interactive programming. There is a widespread recognition that
  debugging is the hard and slow part of system programming, and slow
  turnaround is the bane of debugging. So the logic of interactive
  programming seems inexorable.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">The Whole and the Parts</h2>
<div class="outline-text-2" id="text-13">


</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1">Designing the Bugs Out</h3>
<div class="outline-text-3" id="text-13-1">

<ul>
<li id="sec-13-1-1">Bug-proofing the definition.<br/>
The most pernicious and subtle bugs are
  system bugs arising from mismatched assumptions made by the authors
  of various components. Careful function definition, careful
  specification, and the disciplined exorcism of frills of function
  and flights of technique all reduce the number of system bugs that
  have to be found.
</li>
</ul>
<ul>
<li id="sec-13-1-2">Testing the specification.<br/>
 Long before any code exists, the spec-
  ification must be handed to an outside testing group to be scruti-
  nized for completeness and clarity.
</li>
</ul>
<ul>
<li id="sec-13-1-3">Top-down design.<br/>
 Niklaus Wirth formalized a design procedure which
  had been used for years by the best programmers.<sup><a class="footref" name="fnr-.11" href="#fn-.11">11</a></sup> Briefly,
  Wirth's procedure is to identify design as a sequence of refinement
  steps. 

<p>
From this process one identifies modules of solution or of
  data whose further refinement can proceed independently of other
  work. The degree of this modularity determines the adaptability and
  changeability of the program.
</p>
<p>
A good top-down design avoids bugs in several ways. First, the clarity
of structure and representation makes the precise state- ment of
requirements and functions of the modules easier. Second, the
partitioning and independence of modules avoids system bugs. Third,
the suppression of detail makes flaws in the structure more apparent.
Fourth, the design can be tested at each of its refinement steps, so
testing can start earlier and focus on the proper level of detail at
each step.
</p>
</li>
</ul>
<ul>
<li id="sec-13-1-4">Structured programming.<br/>
Another important set of new ideas for designing the bugs out of
programs derives largely from Dijkstra<sup><a class="footref" name="fnr-.12" href="#fn-.12">12</a></sup>, and is built on a theoretical
structure by Bohm and Jacopini<sup><a class="footref" name="fnr-.13" href="#fn-.13">13</a></sup>. 

<p>
The important point, and the one vital to constructing bug- free
programs, is that one wants to think about the control struc- tures of
a system as control structures, not as individual branch statements.
This way of thinking is a major step forward.
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2">Component Debugging</h3>
<div class="outline-text-3" id="text-13-2">

<ul>
<li id="sec-13-2-1">On-machine debugging.<br/>
</li>
</ul>
<ul>
<li id="sec-13-2-2">Memorydumps.<br/>
</li>
</ul>
<ul>
<li id="sec-13-2-3">Snapshots.<br/>
So people developed techniques for selective dumping, selective
tracing, and for inserting snapshots into programs. 
</li>
</ul>
<ul>
<li id="sec-13-2-4">Interactive debugging.<br/>
</li>
</ul>
</div>

</div>
