public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3">System Debugging</h3>
<div class="outline-text-3" id="text-13-3">

<p>The unexpectedly hard part of building a programming system is
system test. one should
be convinced of two things: system debugging will take longer
than one expects, and its difficulty justifies a thoroughly system-
atic and planned approach. Let us now see what such an approach
involves.<sup><a class="footref" name="fnr-.14" href="#fn-.14">14</a></sup>
</p><ul>
<li id="sec-13-3-1">Use debugged components.<br/>
</li>
</ul>
<ul>
<li id="sec-13-3-2">Build plenty of scaffolding.<br/>
By scaffolding I mean all programs and data built for debugging
purposes but never intended to be in the final product.

<p>
One form of scaffolding is the dummy component, which con- sists only
of interfaces and perhaps some faked data or some small test cases. 
</p>
<p>
Another form is the miniature file. A very common form of system bug
is misunderstanding of formats for tape and disk files. So it is
worthwhile to build some little files that have only a few typical
records, but all the descriptions, pointers, etc.
</p>
<p>
Yet another form of scaffolding are auxiliary programs. Gener- ators
for test data, special analysis printouts, cross-reference table
analyzers, are all examples of the special-purpose jigs and fixtures
one may want to build.<sup><a class="footref" name="fnr-.15" href="#fn-.15">15</a></sup>
</p>
</li>
</ul>
<ul>
<li id="sec-13-3-3">Control changes.<br/>
Tight control during test is one of the impres- sive techniques of
hardware debugging, and it applies as well to software systems.

<p>
First, somebody must be in charge. He and he alone must authorize
component changes or substitution of one version for another.
</p>
<p>
Then, as discussed above, there must be controlled copies of the
system: one locked-up copy of the latest versions, used for component
testing; one copy under test, with fixes being installed; playpen
copies where each man can work away on his component, doing both fixes
and extensions.
</p>
<p>
Programming needs a purple-wire technique, and it badly needs tight
control and deep respect for the paper that ultimately is the product.
The vital ingredients of such technique are the logging of all changes
in a journal and the distinction, carried conspicuously in source
code, between quick patches and thought-through, tested, documented
fixes.
</p>
</li>
</ul>
<ul>
<li id="sec-13-3-4">Add one component at a time.<br/>
Note that one must have thorough test cases, testing the par- tial systems after each new piece is added. And the old ones, run successfully on the last partial sum, must be rerun on the new one
to test for system regression.
</li>
</ul>
<ul>
<li id="sec-13-3-5">Quantize updates.<br/>
The replacement of a working component by a new version requires the
same systematic testing procedure that adding a new component does,
although it should require less time, for more complete and efficient
test cases will usually be available.

<p>
But the changes need to be quantized. Then each user has periods of
productive stability, interrupted by bursts of test-bed change. This
seems to be much less disruptive than a constant rippling and
trembling
</p>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">Hatching a Catastrophe</h2>
<div class="outline-text-2" id="text-14">


</div>

<div id="outline-container-14-1" class="outline-3">
<h3 id="sec-14-1">Milestones or Millstones?</h3>
<div class="outline-text-3" id="text-14-1">

<p>For picking the milestones there is only one relevant rule.
Milestones must be concrete, specific, measurable events, defined
with knife-edge sharpness.
</p></div>

</div>

<div id="outline-container-14-2" class="outline-3">
<h3 id="sec-14-2">"The Other Piece Is Late, Anyway"</h3>
<div class="outline-text-3" id="text-14-2">

<p>he PERT technique, strictly speaking, is an elaboration of
critical-path scheduling in which one estimates three times for
every event, times corresponding to different probabilities of
meeting the estimated dates.
</p></div>

</div>

<div id="outline-container-14-3" class="outline-3">
<h3 id="sec-14-3">Under the Rug</h3>
<div class="outline-text-3" id="text-14-3">

<p>Two rug-lifting techniques are open to the boss. Both must be
used. The first is to reduce the role conflict and inspire sharing of
status. The other is to yank the rug back.
</p><ul>
<li id="sec-14-3-1">Reducing the role conflict.<br/>
The boss must first distinguish be-
tween action information and status information. He must disci-
pline himself not to act on problems his managers can solve, and
never to act on problems when he is explicitly reviewing status. 

<p>
This whole process is helped if the boss labels meetings, re-
views, conferences, as status-review meetings versus problem-action
meetings, and controls himself accordingly.
</p></li>
</ul>
<ul>
<li id="sec-14-3-2">Yanking the rug off.<br/>
Nevertheless, it is necessary to have review
techniques by which the true status is made known, whether
cooperatively or not. The PERT chart with its frequent sharp
milestones is the basis for such review.

<p>
A report showing milestones and actual completions is the key
document.
</p>
<p>
Everyone knows the
questions, and the component manager should be prepared to
explain why it's late, when it will be finished, what steps he's
taking, and what help, if any, he needs from the boss or collateral
groups.
</p></li>
</ul>
</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">The Other Face</h2>
<div class="outline-text-2" id="text-15">


</div>

<div id="outline-container-15-1" class="outline-3">
<h3 id="sec-15-1">What Documentation Is Required?</h3>
<div class="outline-text-3" id="text-15-1">

<p>To use a program. Every user needs a prose description of the
program. Most documentation fails in giving too little overview.
The trees are described, the bark and leaves are commented, but
there is no map of the forest. To write a useful prose description,
stand way back and come in slowly:
</p><ol>
<li>Purpose. What is the main function, the reason for the program?
</li>
<li>Environment. On what machines, hardware configurations, and
   operating system configurations will it run?
</li>
<li>Domain and range. What domain of input is valid? What range of
   output can legitimately appear?
</li>
<li>Functions realized and algorithms used. Precisely what does it do?
</li>
<li>Input-output formats,, precise and complete.
</li>
<li>Operating instructions, including normal and abnormal ending
   behavior, as seen at the console and on the outputs.
</li>
<li>Options. What choices does the user have about functions? Exactly
   how are those choices specified?
</li>
<li>Running time. How long does it take to do a problem of specified
   size on a specified configuration?
</li>
<li>Accuracy and checking. How precise are the answers expected to be?
   What means of checking accuracy are incorporated?
</li>
</ol>

<ul>
<li id="sec-15-1-1">To believe a program.<br/>
Then one needs more thorough test cases, which are normally
run only after a program is modified. These fall into three parts of
the input data domain:
<ol>
<li>Mainline cases that test the program's chief functions for commonly
   encountered data.
</li>
<li>Barely legitimate cases that probe the edge of the input data
   domain, ensuring that largest possible values, smallest possible
   values, and all kinds of valid exceptions work.
</li>
<li>Barely illegitimate cases that probe the domain boundary from the
   other side, ensuring that invalid inputs raise proper diagnostic
   messages.
</li>
</ol>

</li>
</ul>
<ul>
<li id="sec-15-1-2">To modify a program.<br/>
For the modifier, as well as the more casual user, the crying need is for a
clear, sharp overview, this time of the internal structure. What are
the components of such an overview?
<ol>
<li>A flow chart or subprogram structure graph. More on this later.
</li>
<li>Complete descriptions of the algorithms used, or else references to such descriptions in the literature.
</li>
<li>An explanation of the layout of all files used.
</li>
<li>An overview of the pass structure—the sequence in which data or
   programs are brought from tape or disk—and what is accomplished on
   each pass.
</li>
<li>A discussion of modifications contemplated in the original design,
   the nature and location of hooks and exits, and discursive
   discussion of the ideas of the original author about what
   modifications might be desirable and how one might proceed. His
   observations on hidden pitfalls are also useful.
</li>
</ol>

</li>
</ul>
</div>

</div>
