public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html

<div id="outline-container-15-2" class="outline-3">
<h3 id="sec-15-2">The Flow-Chart Curse</h3>
<div class="outline-text-3" id="text-15-2">

<p>Flow charts show the decision structure of a program, which
is only one aspect of its structure. They show decision structure
rather elegantly when the flow chart is on one page, but the overview breaks down badly when one has multiple pages, sewed
together with numbered exits and connectors.
</p></div>

</div>

<div id="outline-container-15-3" class="outline-3">
<h3 id="sec-15-3">Self-Documenting Programs</h3>
<div class="outline-text-3" id="text-15-3">

<p>The solution, I think, is to merge the files, to incorporate the
documentation in the source program. This is at once a powerful
incentive toward proper maintenance, and an insurance that the
documentation will always be handy to the program user. Such
programs are called self-documenting.
</p>
<p>
An approach. The first notion is to use the parts of the program
that have to be there anyway, for programming language reasons,
to carry as much of the documentation as possible. So labels,
declaration statements, and symbolic names are all harnessed to
the task of conveying as much meaning as possible to the reader.
</p>
<p>
A second notion is to use space and format as much as possible
to improve readability and show subordination and nesting.
</p>
<p>
The third notion is to insert the necessary prose documenta-
tion into the program as paragraphs of comment. Most programs
tend to have enough line-by-line comments; those programs pro-
duced to meet stiff organizational standards for "good documenta-
tion" often have too many. 
</p>
<p>
Why not? What are the drawbacks of such an approach to docu-
mentation? There are several, which have been real but are becom-
ing imaginary with changing times.
</p>
<p>
The most serious objection is the increase in the size of the
source code that must be stored. 
</p>
<p>
Yet simultaneously we are moving also toward on-line storage
of prose documents for access and for updating via computerized
text-editing. As shown above, amalgamating prose and program
reduces the total number of characters to be stored.
</p>
</div>
</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">No Silver Bullet-Essence and Accident in Software Engineering</h2>
<div class="outline-text-2" id="text-16">


</div>

<div id="outline-container-16-1" class="outline-3">
<h3 id="sec-16-1">Abstract<sup><a class="footref" name="fnr-.16" href="#fn-.16">16</a></sup></h3>
<div class="outline-text-3" id="text-16-1">

<p>Therefore it appears that the time has come to address the
essential parts of the software task, those concerned with fashioning
abstract conceptual structures of great complexity. I suggest:
</p>
<ul>
<li>Exploiting the mass market to avoid constructing what can be bought.
</li>
<li>Using rapid prototyping as part of a planned iteration in establishing software requirements.
</li>
<li>Growing software organically, adding more and more function to systems as they are run, used, and tested.
</li>
<li>Identifying and developing the great conceptual designers of the rising generation.
</li>
</ul>


</div>

</div>

<div id="outline-container-16-2" class="outline-3">
<h3 id="sec-16-2">Introduction</h3>
<div class="outline-text-3" id="text-16-2">

<p>There is no single development, in either technology or management technique, which by itself promises even
one order of magnitude improvement in productivity, in reliability, in
simplicity.
</p>
<p>
The first step toward the management of disease was replacement of demon theories and humours theories by the germ
theory. That very step, the beginning of hope, in itself dashed
all hopes of magical solutions. It told workers that progress
would be made stepwise, at great effort, and that a persistent,
unremitting care would have to be paid to a discipline of clean-
liness. So it is with software engineering today.
</p>
</div>

</div>

<div id="outline-container-16-3" class="outline-3">
<h3 id="sec-16-3">Does It Have to Be Hard?—Essential Difficulties</h3>
<div class="outline-text-3" id="text-16-3">

<p>First, we must observe that the anomaly is not that software
progress is so slow but that computer hardware progress is so
fast. No other technology since civilization began has seen six
orders of magnitude price-performance gain in 30 years. In no
other technology can one choose to take the gain in either improved performance or in reduced costs. These gains flow from
the transformation of computer manufacture from an assembly
industry into a process industry.
</p>
<p>
Second, to see what rate of progress we can expect in software
technology, let us examine its difficulties. Following Aristotle, I
divide them into essence&ndash;the difficulties inherent in the
nature of the software&ndash;and accidents—-those difficulties that today
attend its production but that are not inherent.
</p>
<p>
The essence of a software entity is a construct of interlocking
concepts: data sets, relationships among data items, algorithms,
and invocations of functions. This essence is abstract, in that the
conceptual construct is the same under many different representations. It is nonetheless highly precise and richly detailed.
</p>
<p>
I believe the hard part of building software to be the specification,
design, and testing of this conceptual construct, not the labor of representing it and testing the fidelity of the representation. We still make
syntax errors, to be sure; but they are fuzz compared to the conceptual errors in most systems.
</p>
<p>
If this is true, building software will always be hard. There is inherently no silver bullet.
</p>
<p>
Let us consider the inherent properties of this irreducible
essence of modern software systems: complexity, conformity,
changeability, and invisibility.
</p>
<ul>
<li id="sec-16-3-1">Complexity.<br/>
  Software entities are more complex for their size than
  perhaps any other human construct, because no two parts are alike
  (at least above the statement level). If they are, we make the two
  similar parts into one, a subroutine, open or closed.

<p>
Likewise, a scaling-up of a software entity is not merely a
repetition of the same elements in larger size; it is necessarily an
increase in the number of different elements. In most cases, the
elements interact with each other in some nonlinear fashion,
and the complexity of the whole increases much more than lin-
early.
</p>
<p>
Many of the classical problems of developing software prod-
ucts derive from this essential complexity and its nonlinear in-
creases with size. From the complexity comes the difficulty
of communication among team members, which leads to prod-
uct flaws, cost overruns, schedule delays. From the complexity
comes the difficulty of enumerating, much less understanding,
all the possible states of the program, and from that comes the
unreliability. From the complexity of the functions comes the
difficulty of invoking those functions, which makes programs
hard to use. From complexity of structure comes the difficulty
of extending programs to new functions without creating side
effects. From complexity of structure comes the unvisualized
states that constitute security trapdoors.
</p>
<p>
Not only technical problems but management problems as
well come from the complexity. This complexity makes overview hard, thus impeding conceptual integrity. It makes it hard
to find and control all the loose ends. It creates the tremendous
learning and understanding burden that makes personnel turnover a disaster.
</p>


</li>
</ul>
<ul>
<li id="sec-16-3-2">Conformity.<br/>
Einstein repeatedly argued
that there must be simplified explanations of nature, because
God is not capricious or arbitrary.

<p>
No such faith comforts the software engineer. Much of the
complexity he must master is arbitrary complexity, forced with-
out rhyme or reason by the many human institutions and systems to which his interfaces must conform. These differ from
interface to interface, and from time to time, not because of
necessity but only because they were designed by different people,
rather than by God.
</p>
<p>
In many cases the software must conform because it has
most recently come to the scene. In others it must conform be-
cause it is perceived as the most conformable. But in all cases,
much complexity comes from conformation to other interfaces;
this cannot be simplified out by any redesign of the software
alone.
</p>
</li>
</ul>
<ul>
<li id="sec-16-3-3">Changeability.<br/>
