src/Books Review/The Mythical Man-Month/The Mythical Man-Month.org
*** Changeability.
The software entity is constantly subject to
pressures for change.

Partly this is because the software in a system embodies its
function, and the function is the part that most feels the pressures
of change. Partly it is because software can be changed more easily—it
is pure thought-stuff, infinitely malleable. Buildings do in fact get
changed, but the high costs of change, understood by all, serve to
dampen the whims of the changers.

*** Invisibility.
Software is invisible and unvisualizable.

As soon as we attempt to diagram soft-
ware structure, we find it to constitute not one, but several,
general directed graphs, superimposed one upon another. The
several graphs may represent the flow of control, the flow of
data, patterns of dependency, time sequence, name-space rela-
tionships. These are usually not even planar, much less hier-
archical. Indeed, one of the ways of establishing conceptual
control over such structure is to enforce link cutting until one or
more of the graphs becomes hierarchical.

In spite of progress in restricting and simplifying the structures of software, they remain inherently unvisualizable, thus
depriving the mind of some of its most powerful conceptual
tools. This lack not only impedes the process of design within
one mind, it severely hinders communication among minds.

*** Past Breakthroughs Solved Accidental Difficulties



























* Footnotes

[fn:1] Backus, J. W., "The syntax and semantics of the proposed
international algebraic language." Proc, Intl. Con/. Inf. Proc.
UNESCO, Paris, 1959, published by R. Oldenbourg, Munich,
and Butterworth, London. Besides this, a whole collection
of papers on the subject is contained in T. B. Steel,
Jr. (ed.), Formal Language Description Languages for Computer
Programming. Amsterdam: North Holland, (1966).

[fn:2] Backus, J. W., "The syntax and semantics of the proposed
international algebraic language." Proc, Intl. Con/. Inf. Proc.
UNESCO, Paris, 1959, published by R. Oldenbourg, Munich,
and Butterworth, London. Besides this, a whole collection
of papers on the subject is contained in T. B. Steel,
Jr. (ed.), Formal Language Description Languages for Computer
Programming. Amsterdam: North Holland, (1966).

[fn:3] Iverson, K. E., A Programming Language. New York: Wiley,
1962, Chapter 2.

[fn:4] Iverson, K. E., A Programming Language. New York: Wiley,
1962, Chapter 2.

[fn:5] Bell and Newell have proposed new notations for describing
both configurations and machine architectures, and they have il-
lustrated these with several machines, including the DEC PDP-8,6
the 7090,6 and System/360.7

[fn:6] Bell, C. G., private communication.

[fn:7] Nanus, B., and L. Farr, "Some cost contributors to largescale
programs," AFIPS Proc. SJCC, 25 (Spring, 1964), pp.
239-248. 

[fn:8] Morin, L. H., "Estimation of resources for computer programming
projects," M. S. thesis, Univ. of North Carolina,
Chapel Hill, 1974.

[fn:9] The matter of design change is complex, and I oversimplify
here. See J. H. Saltzer, "Evolutionary design of complex systems,"
in D. Eckman (ed.), Systems: Research and Design.
New York: Wiley, 1961. When all is said and done, however,
I still advocate building a pilot system whose discarding is
planned.

[fn:10] See also J. W. Pomeroy, "A guide to programming tools and
techniques," IBM Sys. J., 11, 3 (1972), pp. 234-254.

[fn:11] Wirth, N., "Program development by stepwise refinement,"
CACM 14, 4 (April, 1971), pp. 221-227. See also Mills, H. "Top-down programming in large systems," in R.
Rustin (ed.)- Debugging Techniques in Large Systems. Englewood
Cliffs, N.J.: Prentice-Hall, 1971, pp. 41-55 and Baker,
F. T., "System quality through structured programming,"
AFIPS Proc FJCC, 41-1 (1972), pp. 339-343.

[fn:12] Dahl, O. J., E. W. Dijkstra, and C. A. R. Hoare, Structured
Programming. London and New York: Academic Press, 1972.
This volume contains the fullest treatment. See also Dijkstra's
germinal letter, "GOTO statement considered harmful,"
CACM, II, 3 (March, 1968), pp. 147-148.

[fn:13] Bohm, C., and A. Jacopini, "Flow diagrams, Turing machines,
and languages with only two formation rules,"
CACM, 9, 5 (May, 1966), pp. 366-371.

[fn:14] A good treatment of development of specifications and of
system build and test is given by F. M. Trapnell, "A systematic
approach to the development of system programs,"
AFIPS Proc S/CC, 34 (1969) pp. 411-418.

[fn:15] A real-time system will require an environment simulator.
See, for example, M. G. Ginzberg, "Notes on testing realtime
system programs," IBM Sys. /., 4, 1 (1965), pp. 58-72.

[fn:16] The essay entitled "No Silver Bullet" is from Information
Processing 1986, the Proceedings of the IFIP Tenth World
Computing Conference, edited by H.-J. Kugler (1986), pp.
1069-76. Reprinted with the kind permission of IFIP and
Elsevier Science B. V., Amsterdam, The Netherlands.








