public_html/Books Review/The Mythical Man-Month/The Mythical Man-Month.html
The software entity is constantly subject to
pressures for change.

<p>
Partly this is because the software in a system embodies its
function, and the function is the part that most feels the pressures
of change. Partly it is because software can be changed more easily—it
is pure thought-stuff, infinitely malleable. Buildings do in fact get
changed, but the high costs of change, understood by all, serve to
dampen the whims of the changers.
</p>
</li>
</ul>
<ul>
<li id="sec-16-3-4">Invisibility.<br/>
Software is invisible and unvisualizable.

<p>
As soon as we attempt to diagram soft-
ware structure, we find it to constitute not one, but several,
general directed graphs, superimposed one upon another. The
several graphs may represent the flow of control, the flow of
data, patterns of dependency, time sequence, name-space rela-
tionships. These are usually not even planar, much less hier-
archical. Indeed, one of the ways of establishing conceptual
control over such structure is to enforce link cutting until one or
more of the graphs becomes hierarchical.
</p>
<p>
In spite of progress in restricting and simplifying the structures of software, they remain inherently unvisualizable, thus
depriving the mind of some of its most powerful conceptual
tools. This lack not only impedes the process of design within
one mind, it severely hinders communication among minds.
</p>
</li>
</ul>
<ul>
<li id="sec-16-3-5">Past Breakthroughs Solved Accidental Difficulties<br/>

<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> Backus, J. W., "The syntax and semantics of the proposed
international algebraic language." Proc, Intl. Con/. Inf. Proc.
UNESCO, Paris, 1959, published by R. Oldenbourg, Munich,
and Butterworth, London. Besides this, a whole collection
of papers on the subject is contained in T. B. Steel,
Jr. (ed.), Formal Language Description Languages for Computer
Programming. Amsterdam: North Holland, (1966).
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> Backus, J. W., "The syntax and semantics of the proposed
international algebraic language." Proc, Intl. Con/. Inf. Proc.
UNESCO, Paris, 1959, published by R. Oldenbourg, Munich,
and Butterworth, London. Besides this, a whole collection
of papers on the subject is contained in T. B. Steel,
Jr. (ed.), Formal Language Description Languages for Computer
Programming. Amsterdam: North Holland, (1966).
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.3" href="#fnr-.3">3</a></sup> Iverson, K. E., A Programming Language. New York: Wiley,
1962, Chapter 2.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.4" href="#fnr-.4">4</a></sup> Iverson, K. E., A Programming Language. New York: Wiley,
1962, Chapter 2.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.5" href="#fnr-.5">5</a></sup> Bell and Newell have proposed new notations for describing
both configurations and machine architectures, and they have il-
lustrated these with several machines, including the DEC PDP-8,6
the 7090,6 and System/360.7
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.6" href="#fnr-.6">6</a></sup> Bell, C. G., private communication.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.7" href="#fnr-.7">7</a></sup> Nanus, B., and L. Farr, "Some cost contributors to largescale
programs," AFIPS Proc. SJCC, 25 (Spring, 1964), pp.
239-248.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.8" href="#fnr-.8">8</a></sup> Morin, L. H., "Estimation of resources for computer programming
projects," M. S. thesis, Univ. of North Carolina,
Chapel Hill, 1974.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.9" href="#fnr-.9">9</a></sup> The matter of design change is complex, and I oversimplify
here. See J. H. Saltzer, "Evolutionary design of complex systems,"
in D. Eckman (ed.), Systems: Research and Design.
New York: Wiley, 1961. When all is said and done, however,
I still advocate building a pilot system whose discarding is
planned.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.10" href="#fnr-.10">10</a></sup> See also J. W. Pomeroy, "A guide to programming tools and
techniques," IBM Sys. J., 11, 3 (1972), pp. 234-254.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.11" href="#fnr-.11">11</a></sup> Wirth, N., "Program development by stepwise refinement,"
CACM 14, 4 (April, 1971), pp. 221-227. See also Mills, H. "Top-down programming in large systems," in R.
Rustin (ed.)- Debugging Techniques in Large Systems. Englewood
Cliffs, N.J.: Prentice-Hall, 1971, pp. 41-55 and Baker,
F. T., "System quality through structured programming,"
AFIPS Proc FJCC, 41-1 (1972), pp. 339-343.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.12" href="#fnr-.12">12</a></sup> Dahl, O. J., E. W. Dijkstra, and C. A. R. Hoare, Structured
Programming. London and New York: Academic Press, 1972.
This volume contains the fullest treatment. See also Dijkstra's
germinal letter, "GOTO statement considered harmful,"
CACM, II, 3 (March, 1968), pp. 147-148.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.13" href="#fnr-.13">13</a></sup> Bohm, C., and A. Jacopini, "Flow diagrams, Turing machines,
and languages with only two formation rules,"
CACM, 9, 5 (May, 1966), pp. 366-371.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.14" href="#fnr-.14">14</a></sup> A good treatment of development of specifications and of
system build and test is given by F. M. Trapnell, "A systematic
approach to the development of system programs,"
AFIPS Proc S/CC, 34 (1969) pp. 411-418.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.15" href="#fnr-.15">15</a></sup> A real-time system will require an environment simulator.
See, for example, M. G. Ginzberg, "Notes on testing realtime
system programs," IBM Sys. /., 4, 1 (1965), pp. 58-72.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.16" href="#fnr-.16">16</a></sup> The essay entitled "No Silver Bullet" is from Information
Processing 1986, the Proceedings of the IFIP Tenth World
Computing Conference, edited by H.-J. Kugler (1986), pp.
1069-76. Reprinted with the kind permission of IFIP and
Elsevier Science B. V., Amsterdam, The Netherlands.
</p>




























</li>
</ul>
</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-10T22:35+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
